# STEP 5: ETL the data from 3NF tables to Facts & Dimension Tables
**IMPORTANT:** The following exercise depends on first having successing completed Exercise 1: Step 4. 

Start by running the code in the cell below to connect to the database. If you are coming back to this exercise, then uncomment and run the first cell to recreate the database. If you recently completed steps 1 through 4, then skip to the second cell.

In [9]:
#!PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila
#!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-schema.sql
#!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-data.sql

In [10]:
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'student'
DB_PASSWORD = 'student'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)
%sql $conn_string

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
postgresql://student:student@127.0.0.1:5432/pagila

'Connected: student@pagila'

### Introducing SQL to SQL ETL
When writing SQL to SQL ETL, you first create a table then use the INSERT and SELECT statements together to populate the table. Here's a simple example.

First, you create a table called test_table.

In [11]:
%%sql
CREATE TABLE test_table
(
  date timestamp,
  revenue  decimal(5,2)
);

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

Then you use the INSERT and SELECT statements to populate the table. In this case, the SELECT statement extracts data from the `payment` table and INSERTs it INTO the `test_table`.

In [12]:
%%sql
INSERT INTO test_table (date, revenue)
SELECT payment_date AS date,
       amount AS revenue
FROM payment;

 * postgresql://student:***@127.0.0.1:5432/pagila
32098 rows affected.

[]

Then you can use a SELECT statement to take a look at your new table.

In [13]:
%sql SELECT * FROM test_table LIMIT 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(datetime.datetime(2017, 1, 24, 21, 40, 19, 996577), Decimal('1.99')),
 (datetime.datetime(2017, 1, 25, 15, 16, 50, 996577), Decimal('0.99')),
 (datetime.datetime(2017, 1, 28, 21, 44, 14, 996577), Decimal('6.99')),
 (datetime.datetime(2017, 1, 29, 0, 58, 2, 996577), Decimal('0.99')),
 (datetime.datetime(2017, 1, 29, 8, 10, 6, 996577), Decimal('4.99'))]

If you need to delete the table and start over, use the DROP TABLE command, like below.

In [14]:
%sql DROP TABLE test_table

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

Great! Now you'll do the same thing below to create the dimension and fact tables for the Star Schema using the data in the 3NF database.

## ETL from 3NF to Star Schema

### 3NF - Entity Relationship Diagram

<img src="./pagila-3nf.png" width="50%"/>

### Star Schema - Entity Relationship Diagram

<img src="pagila-star.png" width="50%"/>

In this section, you'll populate the tables in the Star schema. You'll `extract` data from the normalized database, `transform` it, and `load` it into the new tables. 

To serve as an example, below is the query that populates the `dimDate` table with data from the `payment` table.
* NOTE 1: The EXTRACT function extracts date parts from the payment_date variable.
* NOTE 2: If you get an error that says that the `dimDate` table doesn't exist, then go back to Exercise 1: Step 4 and recreate the tables.

In [15]:
%%sql
INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(payment_date)                                           AS date,
       EXTRACT(year FROM payment_date)                              AS year,
       EXTRACT(quarter FROM payment_date)                           AS quarter,
       EXTRACT(month FROM payment_date)                             AS month,
       EXTRACT(day FROM payment_date)                               AS day,
       EXTRACT(week FROM payment_date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) THEN true ELSE false END AS is_weekend
FROM payment;

 * postgresql://student:***@127.0.0.1:5432/pagila
40 rows affected.

[]

In [16]:
%sql select * from dimDate limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(20170407, datetime.date(2017, 4, 7), 2017, 2, 4, 7, 14, False),
 (20170130, datetime.date(2017, 1, 30), 2017, 1, 1, 30, 5, False),
 (20170318, datetime.date(2017, 3, 18), 2017, 1, 3, 18, 11, True),
 (20170426, datetime.date(2017, 4, 26), 2017, 2, 4, 26, 17, False),
 (20170317, datetime.date(2017, 3, 17), 2017, 1, 3, 17, 11, False)]

TODO: Now it's your turn. Populate the `dimCustomer` table with data from the `customer`, `address`, `city`, and `country` tables. Use the starter code as a guide.

In [18]:
%%sql
INSERT INTO dimCustomer (customer_key, customer_id, first_name, last_name, email, address, 
                         address2, district, city, country, postal_code, phone, active, 
                         create_date, start_date, end_date)
SELECT 
       c.customer_id AS customer_key,
       c.customer_id,
       c.first_name, 
       c.last_name, 
       c.email, 
       a.address, 
       a.address2, 
       a.district, 
       ci.city, 
       co.country, 
       a.postal_code, 
       a.phone, 
       c.active, 
       c.create_date,

       now()         AS start_date,
       now()         AS end_date
FROM customer c
JOIN address a  ON (c.address_id = a.address_id)
JOIN city ci    ON (a.city_id = ci.city_id)
JOIN country co ON (ci.country_id = co.country_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
599 rows affected.

[]

In [19]:
%sql select * from dimCustomer limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', '1913 Hanoi Way', '', 'Nagasaki', 'Sasebo', 'Japan', '35200', '28303384290', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2019, 8, 30), datetime.date(2019, 8, 30)),
 (2, 2, 'PATRICIA', 'JOHNSON', 'PATRICIA.JOHNSON@sakilacustomer.org', '1121 Loja Avenue', '', 'California', 'San Bernardino', 'United States', '17886', '838635286649', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2019, 8, 30), datetime.date(2019, 8, 30)),
 (3, 3, 'LINDA', 'WILLIAMS', 'LINDA.WILLIAMS@sakilacustomer.org', '692 Joliet Street', '', 'Attika', 'Athenai', 'Greece', '83579', '448477190408', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2019, 8, 30), datetime.date(2019, 8, 30)),
 (4, 4, 'BARBARA', 'JONES', 'BARBARA.JONES@sakilacustomer.org', '1566 Inegl Manor', '', 'Mandalay', 'Myingyan', 'Myanmar', '53561', '705814003527', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2019, 8, 30), datetime.date(2019, 8, 30)),
 (5, 5, 'ELIZABETH', 'BROWN', 'ELIZABETH.BROWN@sakilacustomer.org', '53 Idfu Parkway', '', 'Nantou', 'Nantou', 'Taiwan', '42399', '10655648674', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2019, 8, 30), datetime.date(2019, 8, 30))]

TODO: Populate the `dimMovie` table with data from the `film` and `language` tables. Use the starter code as a guide.

TODO: Populate the `dimStore` table with data from the `store`, `staff`, `address`, `city`, and `country` tables. This time, there's no guide. You should write the query from scratch. Use the previous queries as a reference.

In [21]:
%sql select * from dimMovie limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 'English', None, 6, 86, 'PG', '{"Deleted Scenes","Behind the Scenes"}'),
 (2, 2, 'ACE GOLDFINGER', 'A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China', 2006, 'English', None, 3, 48, 'G', '{Trailers,"Deleted Scenes"}'),
 (3, 3, 'ADAPTATION HOLES', 'A Astounding Reflection of a Lumberjack And a Car who must Sink a Lumberjack in A Baloon Factory', 2006, 'English', None, 7, 50, 'NC-17', '{Trailers,"Deleted Scenes"}'),
 (4, 4, 'AFFAIR PREJUDICE', 'A Fanciful Documentary of a Frisbee And a Lumberjack who must Chase a Monkey in A Shark Tank', 2006, 'English', None, 5, 117, 'G', '{Commentaries,"Behind the Scenes"}'),
 (5, 5, 'AFRICAN EGG', 'A Fast-Paced Documentary of a Pastry Chef And a Dentist who must Pursue a Forensic Psychologist in The Gulf of Mexico', 2006, 'English', None, 6, 130, 'G', '{"Deleted Scenes"}')]

In [20]:
%%sql
INSERT INTO dimMovie (  movie_key, film_id, title, description, release_year, language, original_language, 
                      rental_duration, length, rating, special_features)
SELECT 
       f.film_id AS movie_key, 
       f.film_id, 
       f.title, 
       f.description, 
       f.release_year, 
       l.name AS language, 
       orig_lang.name AS original_language,
       f.rental_duration, 
       f.length, 
       f.rating, 
       f.special_features
FROM film f
JOIN language l              ON (f.language_id=l.language_id)
LEFT JOIN language orig_lang ON (f.original_language_id = orig_lang.language_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
1000 rows affected.

[]

In [23]:


%%sql
INSERT INTO dimStore ( store_key, store_id, address, address2, district, city, country, postal_code, 
                      manager_first_name, manager_last_name, start_date, end_date)
SELECT 
       s.store_id AS store_key, 
       s.store_id, 
       a.address, 
       a.address2, 
       a.district, 
       c.city, 
       co.country, 
       a.postal_code, 
       st.first_name AS manager_first_name, 
       st.last_name AS manager_last_name, 
       now() AS start_date, 
       now() AS end_date


FROM store s
JOIN staff st ON (s.manager_staff_id = st.staff_id)
JOIN address a ON (s.address_id=a.address_id)
JOIN city c ON (a.city_id=c.city_id)
JOIN country co ON (c.country_id=co.country_id)

 * postgresql://student:***@127.0.0.1:5432/pagila
2 rows affected.

[]

In [24]:
%sql select * from dimStore limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
2 rows affected.

[(1, 1, '47 MySakila Drive', None, 'Alberta', 'Lethbridge', 'Canada', '', 'Mike', 'Hillyer', datetime.date(2019, 8, 30), datetime.date(2019, 8, 30)),
 (2, 2, '28 MySQL Boulevard', None, 'QLD', 'Woodridge', 'Australia', '', 'Jon', 'Stephens', datetime.date(2019, 8, 30), datetime.date(2019, 8, 30))]

TODO: Populate the 'factSales' table with data from the 'payment','rental', and 'inventory' tables. This time, there's no guide. You should write the query from scratch. Use the previous queries as a reference.

In [27]:
%%sql
INSERT INTO factSales ( date_key, customer_key, movie_key, store_key, sales_amount)
SELECT 
  TO_CHAR(p.payment_date :: DATE, 'yyyyMMDD')::integer AS date_key,

  p.customer_id AS customer_key, 
  i.film_id AS movie_key, 
  i.store_id AS store_key,
  p.amount AS sales_amount

FROM payment p
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (r.inventory_id=i.inventory_id)

 * postgresql://student:***@127.0.0.1:5432/pagila

IntegrityError: (psycopg2.IntegrityError) null value in column "sales_key" violates not-null constraint
DETAIL:  Failing row contains (null, 20170124, 269, 870, 2, 1.99).
 [SQL: "INSERT INTO factSales ( date_key, customer_key, movie_key, store_key, sales_amount)\nSELECT \n  TO_CHAR(p.payment_date :: DATE, 'yyyyMMDD')::integer AS date_key,\n\n  p.customer_id AS customer_key, \n  i.film_id AS movie_key, \n  i.store_id AS store_key,\n  p.amount AS sales_amount\n\nFROM payment p\nJOIN rental r ON (p.rental_id = r.rental_id)\nJOIN inventory i ON (r.inventory_id=i.inventory_id)"]